tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
brew 'ack'
brew 'android-platform-tools'
brew 'libyaml'
brew 'openssl'
brew 'pkg-config'
brew 'ansible'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'bash-completion'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'gettext'
brew 'dos2unix'
brew 'libpng'
brew 'freetype'
brew 'gdbm'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'go'
brew 'grc'
brew 'htop'
brew 'hugo'
brew 'icu4c'
brew 'jpeg'
brew 'liblqr'
brew 'libtiff'
brew 'libtool'
brew 'imagemagick'
brew 'libevent'
brew 'libgpg-error'
brew 'libidn'
brew 'libksba'
brew 'libssh2'
brew 'libxml2'
brew 'mono'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rust'
brew 'sleepwatcher'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'utf8proc'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'watchman'
brew 'wget', args: ['with-iri']
brew 'zsh'
cask 'atom'
cask 'calibre'
cask 'dictunifier'
cask 'docker-toolbox'
cask 'dropbox'
cask 'firefoxdeveloperedition'
cask 'google-chrome'
cask 'handbrake'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'kodi'
cask 'macvim'
cask 'mplayerx'
cask 'osxfuse'
cask 'spotify'
cask 'steam'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
