# this is a whitelist of formulae that I want.
# clean up using this command
# brew bundle cleanup --force
# install or upgrade using
# brew bundle
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'ctop'
brew 'dive'
brew 'dos2unix'
brew 'fzf'
brew 'git-lfs'
brew 'graphviz'
brew 'gnu-units'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'ngrep'
brew 'nmap'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'sevenzip'
brew 'sleepwatcher'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'xmlstarlet'
brew 'xmlto'
brew 'yq'
brew 'zsh'

cask '1password'
cask 'aerial'
cask 'anki'
cask 'autodesk-fusion'
cask 'blender'
cask 'calibre'
cask 'docker'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'google-earth-pro'
cask 'handbrake'
cask 'iterm2'
cask 'keepingyouawake'
cask 'macvim'
cask 'obsidian'
cask 'openscad'
cask 'orcaslicer'
cask 'prusaslicer'
cask 'raycast'
cask 'rectangle'
cask 'sanesidebuttons'
cask 'scratch'
cask 'slic3r'
cask 'sonic-pi'
cask 'superslicer'
cask 'ultimaker-cura'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
